In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config.ini')


host = config['myaws']['host']  
user = config['myaws']['user'] 
pwd = config['myaws']['pwd'] 
database = config['myaws']['database']

In [37]:
conn = psycopg2.connect(host = host, user = user, password = pwd, dbname = database)

In [38]:
cur = conn.cursor()

In [6]:
sql_statement = '''
            select * from student_gp19
            '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

('tomcally68@dukes.jmu.edu                                                                            ',
 'Tom Callaghan                                                                                       ',
 'Business            ')

In [9]:
for result in cur.fetchall():
    print(result)

('Franwantsme18@dukes.jmu.edu                                                                         ', 'Fran Fantom                                                                                         ', 'Yoga                ')
('billwyrnes66@dukes.jmu.edu                                                                          ', 'Bill Wyrnes                                                                                         ', 'SMAD                ')
('tannercrack42@dukes.jmu.edu                                                                         ', 'Tanner Hunt                                                                                         ', 'Chemistry           ')
('larryneal69@dukes.jmu.edu                                                                           ', 'Lenard Neal                                                                                         ', 'IA                  ')
('jlan@dukes.jmu.edu                                                                                  ', 'jorge lanham                                                                                        ', 'GS                  ')
('patty@dukes.jmu.edu                                                                                 ', 'patty ice                                                                                           ', 'IA                  ')

# Q1

In [10]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,tomcally68@dukes.jmu.edu ...,Tom Callaghan ...,Business
1,Franwantsme18@dukes.jmu.edu ...,Fran Fantom ...,Yoga
2,billwyrnes66@dukes.jmu.edu ...,Bill Wyrnes ...,SMAD
3,tannercrack42@dukes.jmu.edu ...,Tanner Hunt ...,Chemistry
4,larryneal69@dukes.jmu.edu ...,Lenard Neal ...,IA
5,jlan@dukes.jmu.edu ...,jorge lanham ...,GS
6,patty@dukes.jmu.edu ...,patty ice ...,IA

exploring data in python using pandas in GitHub

# Q2

In [11]:
sql_statement_two = '''
            select 
            cname,
            count(semail)
            from enroll_list_gp19
            group by cname
            order by count(semail) desc
            limit 1
            '''

In [12]:
df = pandas.read_sql_query(sql_statement_two,conn)
df[:]

                                               cname  count
0  IA300                                         ...      2

# Q3

In [13]:
sql_statement_three = '''
            select * from teacher_gp19
            left join course_gp19 on teacher_gp19.email = course_gp19.temail
            '''

In [14]:
df = pandas.read_sql_query(sql_statement_three,conn)
df[:]

,email,name,office,name,room,temail
0,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT 116,IA240 ...,ENGEO 2010,moore8ka@jmu.edu ...
1,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT 223,IA313 ...,ENGEO 2202,hendrinx@jmu.edu ...
2,waltontr@jmu.edu ...,Timothy Walton ...,ISAT 326,IA200 ...,ENGEO 1100,waltontr@jmu.edu ...
3,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT 116,IA 420 ...,ISAT 69,moore8ka@jmu.edu ...
4,stevenG@dukes.jmu.edu ...,Steven Gordan ...,isat 336,new course ...,isat 337,stevenG@dukes.jmu.edu ...
5,stevenG@dukes.jmu.edu ...,Steven Gordan ...,isat 336,IA300 ...,ENGEO 1204,stevenG@dukes.jmu.edu ...
6,stevenG@dukes.jmu.edu ...,Steven Gordan ...,isat 336,IA210 ...,ISAT 112,stevenG@dukes.jmu.edu ...
7,new_email1 ...,new_name1 ...,new_office1,None,None,None
8,marrinsp@jmu.edu ...,Stephen Marrin ...,ENGEO 2214,None,None,None

# Q4

In [15]:
sql_statement_four = '''
            select teacher_gp19.name as tname,
            count (course_gp19.name) as course_num
            from teacher_gp19
            inner join course_gp19
            on teacher_gp19.email = course_gp19.temail
            group by teacher_gp19.name
            order by count (course_gp19) desc
            limit 1
            '''

In [16]:
df = pandas.read_sql_query(sql_statement_four,conn)
df[:]

                                               tname  course_num
0  Steven Gordan                                 ...           3

# Q5

In [17]:
sql_insert_statement = '''
                       insert into teacher_gp19(email,name,office)
                       values('{}','{}','{}')

                       '''.format('new_email1','new_name1','new_office1')
print(sql_insert_statement)

                       insert into teacher_gp19(email,name,office)
                       values('new_email1','new_name1','new_office1')

In [ ]:
cur.execute(sql_insert_statement)

In [ ]:
conn.commit()

In [18]:
df = pandas.read_sql_query('''select * from teacher_gp19''',conn)
df[:]

,email,name,office
0,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT 223
1,marrinsp@jmu.edu ...,Stephen Marrin ...,ENGEO 2214
2,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT 116
3,waltontr@jmu.edu ...,Timothy Walton ...,ISAT 326
4,stevenG@dukes.jmu.edu ...,Steven Gordan ...,isat 336
5,new_email1 ...,new_name1 ...,new_office1

# Q6

In [39]:
sql_statement_five = '''
                       update course_gp19
                       set temail = 'new_email1'
                       where temail = 'marrinsp@jmu.edu';
                       delete from teacher_gp19
                       where email = 'marrinsp@jmu.edu'

                       '''
print(sql_statement_five)

                       update course_gp19
                       set temail = 'new_email1'
                       where temail = 'marrinsp@jmu.edu';
                       delete from teacher_gp19
                       where email = 'marrinsp@jmu.edu'

In [40]:
cur.execute(sql_statement_five)

In [41]:
conn.commit()

In [42]:
df = pandas.read_sql_query("""select * from course_gp19""",conn)
df[:]

,name,room,temail
0,IA240 ...,ENGEO 2010,moore8ka@jmu.edu ...
1,IA313 ...,ENGEO 2202,hendrinx@jmu.edu ...
2,IA200 ...,ENGEO 1100,waltontr@jmu.edu ...
3,IA 420 ...,ISAT 69,moore8ka@jmu.edu ...
4,new course ...,isat 337,stevenG@dukes.jmu.edu ...
5,IA300 ...,ENGEO 1204,stevenG@dukes.jmu.edu ...
6,IA210 ...,ISAT 112,stevenG@dukes.jmu.edu ...

In [36]:
cur.close()
conn.close()